Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_CCM.h
/*! @name CLOCK_GROUP_CONTROL_TOG - Clock group control */
/*! @{ */

#define CCM_CLOCK_GROUP_CONTROL_TOG_DIV0_MASK    (0xFU)
#define CCM_CLOCK_GROUP_CONTROL_TOG_DIV0_SHIFT   (0U)
/*! DIV0 - Clock divider0 */
#define CCM_CLOCK_GROUP_CONTROL_TOG_DIV0(x)      (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_CONTROL_TOG_DIV0_SHIFT)) & CCM_CLOCK_GROUP_CONTROL_TOG_DIV0_MASK)

#define CCM_CLOCK_GROUP_CONTROL_TOG_RSTDIV_MASK  (0xFF0000U)
#define CCM_CLOCK_GROUP_CONTROL_TOG_RSTDIV_SHIFT (16U)
/*! RSTDIV - Clock group global restart count */
#define CCM_CLOCK_GROUP_CONTROL_TOG_RSTDIV(x)    (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_CONTROL_TOG_RSTDIV_SHIFT)) & CCM_CLOCK_GROUP_CONTROL_TOG_RSTDIV_MASK)

#define CCM_CLOCK_GROUP_CONTROL_TOG_OFF_MASK     (0x1000000U)
#define CCM_CLOCK_GROUP_CONTROL_TOG_OFF_SHIFT    (24U)
/*! OFF - OFF */
#define CCM_CLOCK_GROUP_CONTROL_TOG_OFF(x)       (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_CONTROL_TOG_OFF_SHIFT)) & CCM_CLOCK_GROUP_CONTROL_TOG_OFF_MASK)
/*! @} */

/* The count of CCM_CLOCK_GROUP_CONTROL_TOG */
#define CCM_CLOCK_GROUP_CONTROL_TOG_COUNT        (2U)

/*! @name CLOCK_GROUP_STATUS0 - Clock group working status */
/*! @{ */

#define CCM_CLOCK_GROUP_STATUS0_DIV0_MASK        (0xFU)
#define CCM_CLOCK_GROUP_STATUS0_DIV0_SHIFT       (0U)
/*! DIV0 - Clock divider */
#define CCM_CLOCK_GROUP_STATUS0_DIV0(x)          (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_STATUS0_DIV0_SHIFT)) & CCM_CLOCK_GROUP_STATUS0_DIV0_MASK)

#define CCM_CLOCK_GROUP_STATUS0_RSTDIV_MASK      (0xFF0000U)
#define CCM_CLOCK_GROUP_STATUS0_RSTDIV_SHIFT     (16U)
/*! RSTDIV - Clock divider */
#define CCM_CLOCK_GROUP_STATUS0_RSTDIV(x)        (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_STATUS0_RSTDIV_SHIFT)) & CCM_CLOCK_GROUP_STATUS0_RSTDIV_MASK)

#define CCM_CLOCK_GROUP_STATUS0_OFF_MASK         (0x1000000U)
#define CCM_CLOCK_GROUP_STATUS0_OFF_SHIFT        (24U)
/*! OFF - OFF
 *  0b0..Clock is running.
 *  0b1..Turn off clock.
 */
#define CCM_CLOCK_GROUP_STATUS0_OFF(x)           (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_STATUS0_OFF_SHIFT)) & CCM_CLOCK_GROUP_STATUS0_OFF_MASK)

#define CCM_CLOCK_GROUP_STATUS0_POWERDOWN_MASK   (0x8000000U)
#define CCM_CLOCK_GROUP_STATUS0_POWERDOWN_SHIFT  (27U)
/*! POWERDOWN - Current clock root POWERDOWN setting
 *  0b0..Clock root is running
 *  0b1..Clock root is Powered Down
 */
#define CCM_CLOCK_GROUP_STATUS0_POWERDOWN(x)     (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_STATUS0_POWERDOWN_SHIFT)) & CCM_CLOCK_GROUP_STATUS0_POWERDOWN_MASK)

#define CCM_CLOCK_GROUP_STATUS0_SLICE_BUSY_MASK  (0x10000000U)
#define CCM_CLOCK_GROUP_STATUS0_SLICE_BUSY_SHIFT (28U)
/*! SLICE_BUSY - Internal updating in generation logic
 *  0b0..Clock generation logic is not busy
 *  0b1..Clock generation logic is applying the new setting
 */
#define CCM_CLOCK_GROUP_STATUS0_SLICE_BUSY(x)    (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_STATUS0_SLICE_BUSY_SHIFT)) & CCM_CLOCK_GROUP_STATUS0_SLICE_BUSY_MASK)

#define CCM_CLOCK_GROUP_STATUS0_UPDATE_FORWARD_MASK (0x20000000U)
#define CCM_CLOCK_GROUP_STATUS0_UPDATE_FORWARD_SHIFT (29U)
/*! UPDATE_FORWARD - Internal status synchronization to clock generation logic
 *  0b0..Synchronization not in process
 *  0b1..Synchronization in process
 */
#define CCM_CLOCK_GROUP_STATUS0_UPDATE_FORWARD(x) (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_STATUS0_UPDATE_FORWARD_SHIFT)) & CCM_CLOCK_GROUP_STATUS0_UPDATE_FORWARD_MASK)

#define CCM_CLOCK_GROUP_STATUS0_UPDATE_REVERSE_MASK (0x40000000U)
#define CCM_CLOCK_GROUP_STATUS0_UPDATE_REVERSE_SHIFT (30U)
/*! UPDATE_REVERSE - Internal status synchronization from clock generation logic
 *  0b0..Synchronization not in process
 *  0b1..Synchronization in process
 */
#define CCM_CLOCK_GROUP_STATUS0_UPDATE_REVERSE(x) (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_STATUS0_UPDATE_REVERSE_SHIFT)) & CCM_CLOCK_GROUP_STATUS0_UPDATE_REVERSE_MASK)

#define CCM_CLOCK_GROUP_STATUS0_CHANGING_MASK    (0x80000000U)
#define CCM_CLOCK_GROUP_STATUS0_CHANGING_SHIFT   (31U)
/*! CHANGING - Internal updating in clock group
 *  0b0..Clock root is not updating currently
 *  0b1..Clock root logic is updating currently
 */
#define CCM_CLOCK_GROUP_STATUS0_CHANGING(x)      (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_STATUS0_CHANGING_SHIFT)) & CCM_CLOCK_GROUP_STATUS0_CHANGING_MASK)
/*! @} */

/* The count of CCM_CLOCK_GROUP_STATUS0 */
#define CCM_CLOCK_GROUP_STATUS0_COUNT            (2U)

/*! @name CLOCK_GROUP_STATUS1 - Clock group low power/extend status */
/*! @{ */

#define CCM_CLOCK_GROUP_STATUS1_TARGET_SETPOINT_MASK (0xF0000U)
#define CCM_CLOCK_GROUP_STATUS1_TARGET_SETPOINT_SHIFT (16U)
/*! TARGET_SETPOINT - Next Setpoint to change to */
#define CCM_CLOCK_GROUP_STATUS1_TARGET_SETPOINT(x) (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_STATUS1_TARGET_SETPOINT_SHIFT)) & CCM_CLOCK_GROUP_STATUS1_TARGET_SETPOINT_MASK)

#define CCM_CLOCK_GROUP_STATUS1_CURRENT_SETPOINT_MASK (0xF00000U)
#define CCM_CLOCK_GROUP_STATUS1_CURRENT_SETPOINT_SHIFT (20U)
/*! CURRENT_SETPOINT - Current Setpoint */
#define CCM_CLOCK_GROUP_STATUS1_CURRENT_SETPOINT(x) (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_STATUS1_CURRENT_SETPOINT_SHIFT)) & CCM_CLOCK_GROUP_STATUS1_CURRENT_SETPOINT_MASK)

#define CCM_CLOCK_GROUP_STATUS1_DOWN_REQUEST_MASK (0x1000000U)
#define CCM_CLOCK_GROUP_STATUS1_DOWN_REQUEST_SHIFT (24U)
/*! DOWN_REQUEST - Clock frequency decrease request
 *  0b0..No handshake signal is not requested
 *  0b1..Handshake signal with GPC status indicating frequency decrease is requested
 */
#define CCM_CLOCK_GROUP_STATUS1_DOWN_REQUEST(x)  (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_STATUS1_DOWN_REQUEST_SHIFT)) & CCM_CLOCK_GROUP_STATUS1_DOWN_REQUEST_MASK)

#define CCM_CLOCK_GROUP_STATUS1_DOWN_DONE_MASK   (0x2000000U)
#define CCM_CLOCK_GROUP_STATUS1_DOWN_DONE_SHIFT  (25U)
/*! DOWN_DONE - Clock frequency decrease complete
 *  0b0..Handshake signal with GPC status indicating frequency decrease is not complete
 *  0b1..Handshake signal with GPC status indicating frequency decrease is complete
 */
#define CCM_CLOCK_GROUP_STATUS1_DOWN_DONE(x)     (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_STATUS1_DOWN_DONE_SHIFT)) & CCM_CLOCK_GROUP_STATUS1_DOWN_DONE_MASK)

#define CCM_CLOCK_GROUP_STATUS1_UP_REQUEST_MASK  (0x4000000U)
#define CCM_CLOCK_GROUP_STATUS1_UP_REQUEST_SHIFT (26U)
/*! UP_REQUEST - Clock frequency increase request
 *  0b0..No handshake signal is not requested
 *  0b1..Handshake signal with GPC status indicating frequency increase is requested
 */
#define CCM_CLOCK_GROUP_STATUS1_UP_REQUEST(x)    (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_STATUS1_UP_REQUEST_SHIFT)) & CCM_CLOCK_GROUP_STATUS1_UP_REQUEST_MASK)

