Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_CCM.h
#define CCM_GPR_PRIVATE7_AUTHEN_TOG_LOCK_MODE_MASK (0x100000U)
#define CCM_GPR_PRIVATE7_AUTHEN_TOG_LOCK_MODE_SHIFT (20U)
/*! LOCK_MODE - Lock low power and access mode */
#define CCM_GPR_PRIVATE7_AUTHEN_TOG_LOCK_MODE(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_PRIVATE7_AUTHEN_TOG_LOCK_MODE_SHIFT)) & CCM_GPR_PRIVATE7_AUTHEN_TOG_LOCK_MODE_MASK)
/*! @} */

/*! @name OSCPLL_DIRECT - Clock source direct control */
/*! @{ */

#define CCM_OSCPLL_DIRECT_ON_MASK                (0x1U)
#define CCM_OSCPLL_DIRECT_ON_SHIFT               (0U)
/*! ON - turn on clock source
 *  0b0..OSCPLL is OFF
 *  0b1..OSCPLL is ON
 */
#define CCM_OSCPLL_DIRECT_ON(x)                  (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_DIRECT_ON_SHIFT)) & CCM_OSCPLL_DIRECT_ON_MASK)
/*! @} */

/* The count of CCM_OSCPLL_DIRECT */
#define CCM_OSCPLL_DIRECT_COUNT                  (29U)

/*! @name OSCPLL_DOMAIN - Clock source domain control */
/*! @{ */

#define CCM_OSCPLL_DOMAIN_LEVEL_MASK             (0x7U)
#define CCM_OSCPLL_DOMAIN_LEVEL_SHIFT            (0U)
/*! LEVEL - Current dependence level
 *  0b000..This clock source is not needed in any mode, and can be turned off
 *  0b001..This clock source is needed in RUN mode, but not needed in WAIT, STOP mode
 *  0b010..This clock source is needed in RUN and WAIT mode, but not needed in STOP mode
 *  0b011..This clock source is needed in RUN, WAIT and STOP mode
 *  0b100..This clock source is always on in any mode (including SUSPEND)
 *  0b101, 0b110, 0b111..Reserved
 */
#define CCM_OSCPLL_DOMAIN_LEVEL(x)               (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_DOMAIN_LEVEL_SHIFT)) & CCM_OSCPLL_DOMAIN_LEVEL_MASK)

#define CCM_OSCPLL_DOMAIN_LEVEL0_MASK            (0x70000U)
#define CCM_OSCPLL_DOMAIN_LEVEL0_SHIFT           (16U)
/*! LEVEL0 - Dependence level
 *  0b000..This clock source is not needed in any mode, and can be turned off
 *  0b001..This clock source is needed in RUN mode, but not needed in WAIT, STOP mode
 *  0b010..This clock source is needed in RUN and WAIT mode, but not needed in STOP mode
 *  0b011..This clock source is needed in RUN, WAIT and STOP mode
 *  0b100..This clock source is always on in any mode (including SUSPEND)
 *  0b101, 0b110, 0b111..Reserved
 */
#define CCM_OSCPLL_DOMAIN_LEVEL0(x)              (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_DOMAIN_LEVEL0_SHIFT)) & CCM_OSCPLL_DOMAIN_LEVEL0_MASK)

#define CCM_OSCPLL_DOMAIN_LEVEL1_MASK            (0x700000U)
#define CCM_OSCPLL_DOMAIN_LEVEL1_SHIFT           (20U)
/*! LEVEL1 - Depend level
 *  0b000..This clock source is not needed in any mode, and can be turned off
 *  0b001..This clock source is needed in RUN mode, but not needed in WAIT, STOP mode
 *  0b010..This clock source is needed in RUN and WAIT mode, but not needed in STOP mode
 *  0b011..This clock source is needed in RUN, WAIT and STOP mode
 *  0b100..This clock source is always on in any mode (including SUSPEND)
 *  0b101, 0b110, 0b111..Reserved
 */
#define CCM_OSCPLL_DOMAIN_LEVEL1(x)              (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_DOMAIN_LEVEL1_SHIFT)) & CCM_OSCPLL_DOMAIN_LEVEL1_MASK)

#define CCM_OSCPLL_DOMAIN_LEVEL2_MASK            (0x7000000U)
#define CCM_OSCPLL_DOMAIN_LEVEL2_SHIFT           (24U)
/*! LEVEL2 - Depend level
 *  0b000..This clock source is not needed in any mode, and can be turned off
 *  0b001..This clock source is needed in RUN mode, but not needed in WAIT, STOP mode
 *  0b010..This clock source is needed in RUN and WAIT mode, but not needed in STOP mode
 *  0b011..This clock source is needed in RUN, WAIT and STOP mode
 *  0b100..This clock source is always on in any mode (including SUSPEND)
 *  0b101, 0b110, 0b111..Reserved
 */
#define CCM_OSCPLL_DOMAIN_LEVEL2(x)              (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_DOMAIN_LEVEL2_SHIFT)) & CCM_OSCPLL_DOMAIN_LEVEL2_MASK)

#define CCM_OSCPLL_DOMAIN_LEVEL3_MASK            (0x70000000U)
#define CCM_OSCPLL_DOMAIN_LEVEL3_SHIFT           (28U)
/*! LEVEL3 - Depend level
 *  0b000..This clock source is not needed in any mode, and can be turned off
 *  0b001..This clock source is needed in RUN mode, but not needed in WAIT, STOP mode
 *  0b010..This clock source is needed in RUN and WAIT mode, but not needed in STOP mode
 *  0b011..This clock source is needed in RUN, WAIT and STOP mode
 *  0b100..This clock source is always on in any mode (including SUSPEND)
 *  0b101, 0b110, 0b111..Reserved
 */
#define CCM_OSCPLL_DOMAIN_LEVEL3(x)              (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_DOMAIN_LEVEL3_SHIFT)) & CCM_OSCPLL_DOMAIN_LEVEL3_MASK)
/*! @} */

/* The count of CCM_OSCPLL_DOMAIN */
#define CCM_OSCPLL_DOMAIN_COUNT                  (29U)

/*! @name OSCPLL_SETPOINT - Clock source Setpoint setting */
/*! @{ */

#define CCM_OSCPLL_SETPOINT_SETPOINT_MASK        (0xFFFFU)
#define CCM_OSCPLL_SETPOINT_SETPOINT_SHIFT       (0U)
/*! SETPOINT - Setpoint */
#define CCM_OSCPLL_SETPOINT_SETPOINT(x)          (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_SETPOINT_SETPOINT_SHIFT)) & CCM_OSCPLL_SETPOINT_SETPOINT_MASK)

#define CCM_OSCPLL_SETPOINT_STANDBY_MASK         (0xFFFF0000U)
#define CCM_OSCPLL_SETPOINT_STANDBY_SHIFT        (16U)
/*! STANDBY - Standby */
#define CCM_OSCPLL_SETPOINT_STANDBY(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_SETPOINT_STANDBY_SHIFT)) & CCM_OSCPLL_SETPOINT_STANDBY_MASK)
/*! @} */

/* The count of CCM_OSCPLL_SETPOINT */
#define CCM_OSCPLL_SETPOINT_COUNT                (29U)

/*! @name OSCPLL_STATUS0 - Clock source working status */
/*! @{ */

#define CCM_OSCPLL_STATUS0_ON_MASK               (0x1U)
#define CCM_OSCPLL_STATUS0_ON_SHIFT              (0U)
/*! ON - Clock source current state
 *  0b0..Clock source is OFF
 *  0b1..Clock source is ON
 */
#define CCM_OSCPLL_STATUS0_ON(x)                 (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS0_ON_SHIFT)) & CCM_OSCPLL_STATUS0_ON_MASK)

#define CCM_OSCPLL_STATUS0_STATUS_EARLY_MASK     (0x10U)
#define CCM_OSCPLL_STATUS0_STATUS_EARLY_SHIFT    (4U)
/*! STATUS_EARLY - Clock source active
 *  0b0..Clock source is not active
 *  0b1..Clock source is active
 */
#define CCM_OSCPLL_STATUS0_STATUS_EARLY(x)       (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS0_STATUS_EARLY_SHIFT)) & CCM_OSCPLL_STATUS0_STATUS_EARLY_MASK)

#define CCM_OSCPLL_STATUS0_STATUS_LATE_MASK      (0x20U)
#define CCM_OSCPLL_STATUS0_STATUS_LATE_SHIFT     (5U)
/*! STATUS_LATE - Clock source ready
 *  0b0..Clock source is not ready to use
 *  0b1..Clock source is ready to use
 */
#define CCM_OSCPLL_STATUS0_STATUS_LATE(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS0_STATUS_LATE_SHIFT)) & CCM_OSCPLL_STATUS0_STATUS_LATE_MASK)

#define CCM_OSCPLL_STATUS0_ACTIVE_DOMAIN_MASK    (0xF00U)
#define CCM_OSCPLL_STATUS0_ACTIVE_DOMAIN_SHIFT   (8U)
/*! ACTIVE_DOMAIN - Domains that own this clock source
 *  0b0000..Clock not owned by any domain
 *  0b0001..Clock owned by Domain0
 *  0b0010..Clock owned by Domain1
 *  0b0011..Clock owned by Domain0 and Domain1
 *  0b0100..Clock owned by Domain2
 *  0b0101..Clock owned by Domain0 and Domain2
 *  0b0110..Clock owned by Domain1 and Domain2
 *  0b0111..Clock owned by Domain0, Domain1 and Domain 2
 *  0b1000..Clock owned by Domain3
 *  0b1001..Clock owned by Domain0 and Domain3
 *  0b1010..Clock owned by Domain1 and Domain3
 *  0b1011..Clock owned by Domain2 and Domain3
 *  0b1100..Clock owned by Domain0, Domain 1, and Domain3
 *  0b1101..Clock owned by Domain0, Domain 2, and Domain3
 *  0b1110..Clock owned by Domain1, Domain 2, and Domain3
 *  0b1111..Clock owned by all domains
 */
#define CCM_OSCPLL_STATUS0_ACTIVE_DOMAIN(x)      (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS0_ACTIVE_DOMAIN_SHIFT)) & CCM_OSCPLL_STATUS0_ACTIVE_DOMAIN_MASK)

#define CCM_OSCPLL_STATUS0_DOMAIN_ENABLE_MASK    (0xF000U)
#define CCM_OSCPLL_STATUS0_DOMAIN_ENABLE_SHIFT   (12U)
/*! DOMAIN_ENABLE - Enable status from each domain
 *  0b0000..No domain request
 *  0b0001..Request from Domain0
 *  0b0010..Request from Domain1
 *  0b0011..Request from Domain0 and Domain1
 *  0b0100..Request from Domain2
 *  0b0101..Request from Domain0 and Domain2
 *  0b0110..Request from Domain1 and Domain2
 *  0b0111..Request from Domain0, Domain1 and Domain 2
 *  0b1000..Request from Domain3
 *  0b1001..Request from Domain0 and Domain3
 *  0b1010..Request from Domain1 and Domain3
 *  0b1011..Request from Domain2 and Domain3
 *  0b1100..Request from Domain0, Domain 1, and Domain3
 *  0b1101..Request from Domain0, Domain 2, and Domain3
 *  0b1110..Request from Domain1, Domain 2, and Domain3
 *  0b1111..Request from all domains
 */
#define CCM_OSCPLL_STATUS0_DOMAIN_ENABLE(x)      (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS0_DOMAIN_ENABLE_SHIFT)) & CCM_OSCPLL_STATUS0_DOMAIN_ENABLE_MASK)

