Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_CCM.h
#define CCM_OSCPLL_STATUS0_IN_USE_MASK           (0x10000000U)
#define CCM_OSCPLL_STATUS0_IN_USE_SHIFT          (28U)
/*! IN_USE - In use
 *  0b0..Clock source is not being used by clock roots
 *  0b1..Clock source is being used by clock roots
 */
#define CCM_OSCPLL_STATUS0_IN_USE(x)             (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS0_IN_USE_SHIFT)) & CCM_OSCPLL_STATUS0_IN_USE_MASK)
/*! @} */

/* The count of CCM_OSCPLL_STATUS0 */
#define CCM_OSCPLL_STATUS0_COUNT                 (29U)

/*! @name OSCPLL_STATUS1 - Clock source low power status */
/*! @{ */

#define CCM_OSCPLL_STATUS1_CPU0_MODE_MASK        (0x3U)
#define CCM_OSCPLL_STATUS1_CPU0_MODE_SHIFT       (0U)
/*! CPU0_MODE - Domain0 Low Power Mode
 *  0b00..Run
 *  0b01..Wait
 *  0b10..Stop
 *  0b11..Suspend
 */
#define CCM_OSCPLL_STATUS1_CPU0_MODE(x)          (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_CPU0_MODE_SHIFT)) & CCM_OSCPLL_STATUS1_CPU0_MODE_MASK)

#define CCM_OSCPLL_STATUS1_CPU0_MODE_REQUEST_MASK (0x4U)
#define CCM_OSCPLL_STATUS1_CPU0_MODE_REQUEST_SHIFT (2U)
/*! CPU0_MODE_REQUEST - Domain0 request enter Low Power Mode
 *  0b0..No request
 *  0b1..Request from domain to enter Low Power Mode
 */
#define CCM_OSCPLL_STATUS1_CPU0_MODE_REQUEST(x)  (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_CPU0_MODE_REQUEST_SHIFT)) & CCM_OSCPLL_STATUS1_CPU0_MODE_REQUEST_MASK)

#define CCM_OSCPLL_STATUS1_CPU0_MODE_DONE_MASK   (0x8U)
#define CCM_OSCPLL_STATUS1_CPU0_MODE_DONE_SHIFT  (3U)
/*! CPU0_MODE_DONE - Domain0 Low Power Mode task done
 *  0b0..Clock is not gated
 *  0b1..Clock is gated-off
 */
#define CCM_OSCPLL_STATUS1_CPU0_MODE_DONE(x)     (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_CPU0_MODE_DONE_SHIFT)) & CCM_OSCPLL_STATUS1_CPU0_MODE_DONE_MASK)

#define CCM_OSCPLL_STATUS1_CPU1_MODE_MASK        (0x30U)
#define CCM_OSCPLL_STATUS1_CPU1_MODE_SHIFT       (4U)
/*! CPU1_MODE - Domain1 Low Power Mode
 *  0b00..Run
 *  0b01..Wait
 *  0b10..Stop
 *  0b11..Suspend
 */
#define CCM_OSCPLL_STATUS1_CPU1_MODE(x)          (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_CPU1_MODE_SHIFT)) & CCM_OSCPLL_STATUS1_CPU1_MODE_MASK)

#define CCM_OSCPLL_STATUS1_CPU1_MODE_REQUEST_MASK (0x40U)
#define CCM_OSCPLL_STATUS1_CPU1_MODE_REQUEST_SHIFT (6U)
/*! CPU1_MODE_REQUEST - Domain1 request enter Low Power Mode
 *  0b0..No request
 *  0b1..Request from domain to enter Low Power Mode
 */
#define CCM_OSCPLL_STATUS1_CPU1_MODE_REQUEST(x)  (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_CPU1_MODE_REQUEST_SHIFT)) & CCM_OSCPLL_STATUS1_CPU1_MODE_REQUEST_MASK)

#define CCM_OSCPLL_STATUS1_CPU1_MODE_DONE_MASK   (0x80U)
#define CCM_OSCPLL_STATUS1_CPU1_MODE_DONE_SHIFT  (7U)
/*! CPU1_MODE_DONE - Domain1 Low Power Mode task done
 *  0b0..Clock is not gated
 *  0b1..Clock is gated-off
 */
#define CCM_OSCPLL_STATUS1_CPU1_MODE_DONE(x)     (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_CPU1_MODE_DONE_SHIFT)) & CCM_OSCPLL_STATUS1_CPU1_MODE_DONE_MASK)

#define CCM_OSCPLL_STATUS1_CPU2_MODE_MASK        (0x300U)
#define CCM_OSCPLL_STATUS1_CPU2_MODE_SHIFT       (8U)
/*! CPU2_MODE - Domain2 Low Power Mode
 *  0b00..Run
 *  0b01..Wait
 *  0b10..Stop
 *  0b11..Suspend
 */
#define CCM_OSCPLL_STATUS1_CPU2_MODE(x)          (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_CPU2_MODE_SHIFT)) & CCM_OSCPLL_STATUS1_CPU2_MODE_MASK)

#define CCM_OSCPLL_STATUS1_CPU2_MODE_REQUEST_MASK (0x400U)
#define CCM_OSCPLL_STATUS1_CPU2_MODE_REQUEST_SHIFT (10U)
/*! CPU2_MODE_REQUEST - Domain2 request enter Low Power Mode
 *  0b0..No request
 *  0b1..Request from domain to enter Low Power Mode
 */
#define CCM_OSCPLL_STATUS1_CPU2_MODE_REQUEST(x)  (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_CPU2_MODE_REQUEST_SHIFT)) & CCM_OSCPLL_STATUS1_CPU2_MODE_REQUEST_MASK)

#define CCM_OSCPLL_STATUS1_CPU2_MODE_DONE_MASK   (0x800U)
#define CCM_OSCPLL_STATUS1_CPU2_MODE_DONE_SHIFT  (11U)
/*! CPU2_MODE_DONE - Domain2 Low Power Mode task done
 *  0b0..Clock is not gated
 *  0b1..Clock is gated-off
 */
#define CCM_OSCPLL_STATUS1_CPU2_MODE_DONE(x)     (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_CPU2_MODE_DONE_SHIFT)) & CCM_OSCPLL_STATUS1_CPU2_MODE_DONE_MASK)

#define CCM_OSCPLL_STATUS1_CPU3_MODE_MASK        (0x3000U)
#define CCM_OSCPLL_STATUS1_CPU3_MODE_SHIFT       (12U)
/*! CPU3_MODE - Domain3 Low Power Mode
 *  0b00..Run
 *  0b01..Wait
 *  0b10..Stop
 *  0b11..Suspend
 */
#define CCM_OSCPLL_STATUS1_CPU3_MODE(x)          (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_CPU3_MODE_SHIFT)) & CCM_OSCPLL_STATUS1_CPU3_MODE_MASK)

#define CCM_OSCPLL_STATUS1_CPU3_MODE_REQUEST_MASK (0x4000U)
#define CCM_OSCPLL_STATUS1_CPU3_MODE_REQUEST_SHIFT (14U)
/*! CPU3_MODE_REQUEST - Domain3 request enter Low Power Mode
 *  0b0..No request
 *  0b1..Request from domain to enter Low Power Mode
 */
#define CCM_OSCPLL_STATUS1_CPU3_MODE_REQUEST(x)  (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_CPU3_MODE_REQUEST_SHIFT)) & CCM_OSCPLL_STATUS1_CPU3_MODE_REQUEST_MASK)

#define CCM_OSCPLL_STATUS1_CPU3_MODE_DONE_MASK   (0x8000U)
#define CCM_OSCPLL_STATUS1_CPU3_MODE_DONE_SHIFT  (15U)
/*! CPU3_MODE_DONE - Domain3 Low Power Mode task done
 *  0b0..Clock is not gated
 *  0b1..Clock is gated-off
 */
#define CCM_OSCPLL_STATUS1_CPU3_MODE_DONE(x)     (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_CPU3_MODE_DONE_SHIFT)) & CCM_OSCPLL_STATUS1_CPU3_MODE_DONE_MASK)

#define CCM_OSCPLL_STATUS1_TARGET_SETPOINT_MASK  (0xF0000U)
#define CCM_OSCPLL_STATUS1_TARGET_SETPOINT_SHIFT (16U)
/*! TARGET_SETPOINT - Next Setpoint to change to */
#define CCM_OSCPLL_STATUS1_TARGET_SETPOINT(x)    (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_TARGET_SETPOINT_SHIFT)) & CCM_OSCPLL_STATUS1_TARGET_SETPOINT_MASK)

#define CCM_OSCPLL_STATUS1_CURRENT_SETPOINT_MASK (0xF00000U)
#define CCM_OSCPLL_STATUS1_CURRENT_SETPOINT_SHIFT (20U)
/*! CURRENT_SETPOINT - Current Setpoint */
#define CCM_OSCPLL_STATUS1_CURRENT_SETPOINT(x)   (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_CURRENT_SETPOINT_SHIFT)) & CCM_OSCPLL_STATUS1_CURRENT_SETPOINT_MASK)

#define CCM_OSCPLL_STATUS1_SETPOINT_OFF_REQUEST_MASK (0x1000000U)
#define CCM_OSCPLL_STATUS1_SETPOINT_OFF_REQUEST_SHIFT (24U)
/*! SETPOINT_OFF_REQUEST - Clock gate turn off request from GPC Setpoint
 *  0b0..No request
 *  0b1..Clock gate requested to be turned off
 */
#define CCM_OSCPLL_STATUS1_SETPOINT_OFF_REQUEST(x) (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_SETPOINT_OFF_REQUEST_SHIFT)) & CCM_OSCPLL_STATUS1_SETPOINT_OFF_REQUEST_MASK)

