Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_CCM.h
#define CCM_OSCPLL_AUTHEN_SETPOINT_MODE_MASK     (0x20000U)
#define CCM_OSCPLL_AUTHEN_SETPOINT_MODE_SHIFT    (17U)
/*! SETPOINT_MODE - LPCG works in Setpoint controlled Mode. */
#define CCM_OSCPLL_AUTHEN_SETPOINT_MODE(x)       (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_AUTHEN_SETPOINT_MODE_SHIFT)) & CCM_OSCPLL_AUTHEN_SETPOINT_MODE_MASK)

#define CCM_OSCPLL_AUTHEN_CPULPM_MASK            (0x40000U)
#define CCM_OSCPLL_AUTHEN_CPULPM_SHIFT           (18U)
/*! CPULPM - CPU Low Power Mode
 *  0b0..PLL does not function in Low power Mode
 *  0b1..PLL functions in Low Power Mode
 */
#define CCM_OSCPLL_AUTHEN_CPULPM(x)              (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_AUTHEN_CPULPM_SHIFT)) & CCM_OSCPLL_AUTHEN_CPULPM_MASK)

#define CCM_OSCPLL_AUTHEN_LOCK_MODE_MASK         (0x100000U)
#define CCM_OSCPLL_AUTHEN_LOCK_MODE_SHIFT        (20U)
/*! LOCK_MODE - Lock low power and access mode
 *  0b0..MODE is not locked.
 *  0b1..MODE is locked.
 */
#define CCM_OSCPLL_AUTHEN_LOCK_MODE(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_AUTHEN_LOCK_MODE_SHIFT)) & CCM_OSCPLL_AUTHEN_LOCK_MODE_MASK)
/*! @} */

/* The count of CCM_OSCPLL_AUTHEN */
#define CCM_OSCPLL_AUTHEN_COUNT                  (29U)

/*! @name LPCG_DIRECT - LPCG direct control */
/*! @{ */

#define CCM_LPCG_DIRECT_ON_MASK                  (0x1U)
#define CCM_LPCG_DIRECT_ON_SHIFT                 (0U)
/*! ON - LPCG on
 *  0b0..LPCG is OFF.
 *  0b1..LPCG is ON.
 */
#define CCM_LPCG_DIRECT_ON(x)                    (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_DIRECT_ON_SHIFT)) & CCM_LPCG_DIRECT_ON_MASK)
/*! @} */

/* The count of CCM_LPCG_DIRECT */
#define CCM_LPCG_DIRECT_COUNT                    (138U)

/*! @name LPCG_DOMAIN - LPCG domain control */
/*! @{ */

#define CCM_LPCG_DOMAIN_LEVEL_MASK               (0x7U)
#define CCM_LPCG_DOMAIN_LEVEL_SHIFT              (0U)
/*! LEVEL - Current dependence level
 *  0b000..This clock source is not needed in any mode, and can be turned off
 *  0b001..This clock source is needed in RUN mode, but not needed in WAIT, STOP mode
 *  0b010..This clock source is needed in RUN and WAIT mode, but not needed in STOP mode
 *  0b011..This clock source is needed in RUN, WAIT and STOP mode
 *  0b100..This clock source is always on in any mode (including SUSPEND)
 *  0b101, 0b110, 0b111..Reserved
 */
#define CCM_LPCG_DOMAIN_LEVEL(x)                 (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_DOMAIN_LEVEL_SHIFT)) & CCM_LPCG_DOMAIN_LEVEL_MASK)

#define CCM_LPCG_DOMAIN_LEVEL0_MASK              (0x70000U)
#define CCM_LPCG_DOMAIN_LEVEL0_SHIFT             (16U)
/*! LEVEL0 - Depend level
 *  0b000..This clock source is not needed in any mode, and can be turned off
 *  0b001..This clock source is needed in RUN mode, but not needed in WAIT, STOP mode
 *  0b010..This clock source is needed in RUN and WAIT mode, but not needed in STOP mode
 *  0b011..This clock source is needed in RUN, WAIT and STOP mode
 *  0b100..This clock source is always on in any mode (including SUSPEND)
 *  0b101, 0b110, 0b111..Reserved
 */
#define CCM_LPCG_DOMAIN_LEVEL0(x)                (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_DOMAIN_LEVEL0_SHIFT)) & CCM_LPCG_DOMAIN_LEVEL0_MASK)

#define CCM_LPCG_DOMAIN_LEVEL1_MASK              (0x700000U)
#define CCM_LPCG_DOMAIN_LEVEL1_SHIFT             (20U)
/*! LEVEL1 - Depend level
 *  0b000..This clock source is not needed in any mode, and can be turned off
 *  0b001..This clock source is needed in RUN mode, but not needed in WAIT, STOP mode
 *  0b010..This clock source is needed in RUN and WAIT mode, but not needed in STOP mode
 *  0b011..This clock source is needed in RUN, WAIT and STOP mode
 *  0b100..This clock source is always on in any mode (including SUSPEND)
 *  0b101, 0b110, 0b111..Reserved
 */
#define CCM_LPCG_DOMAIN_LEVEL1(x)                (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_DOMAIN_LEVEL1_SHIFT)) & CCM_LPCG_DOMAIN_LEVEL1_MASK)

#define CCM_LPCG_DOMAIN_LEVEL2_MASK              (0x7000000U)
#define CCM_LPCG_DOMAIN_LEVEL2_SHIFT             (24U)
/*! LEVEL2 - Depend level
 *  0b000..This clock source is not needed in any mode, and can be turned off
 *  0b001..This clock source is needed in RUN mode, but not needed in WAIT, STOP mode
 *  0b010..This clock source is needed in RUN and WAIT mode, but not needed in STOP mode
 *  0b011..This clock source is needed in RUN, WAIT and STOP mode
 *  0b100..This clock source is always on in any mode (including SUSPEND)
 *  0b101, 0b110, 0b111..Reserved
 */
#define CCM_LPCG_DOMAIN_LEVEL2(x)                (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_DOMAIN_LEVEL2_SHIFT)) & CCM_LPCG_DOMAIN_LEVEL2_MASK)

#define CCM_LPCG_DOMAIN_LEVEL3_MASK              (0x70000000U)
#define CCM_LPCG_DOMAIN_LEVEL3_SHIFT             (28U)
/*! LEVEL3 - Depend level
 *  0b000..This clock source is not needed in any mode, and can be turned off
 *  0b001..This clock source is needed in RUN mode, but not needed in WAIT, STOP mode
 *  0b010..This clock source is needed in RUN and WAIT mode, but not needed in STOP mode
 *  0b011..This clock source is needed in RUN, WAIT and STOP mode
 *  0b100..This clock source is always on in any mode (including SUSPEND)
 *  0b101, 0b110, 0b111..Reserved
 */
#define CCM_LPCG_DOMAIN_LEVEL3(x)                (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_DOMAIN_LEVEL3_SHIFT)) & CCM_LPCG_DOMAIN_LEVEL3_MASK)
/*! @} */

/* The count of CCM_LPCG_DOMAIN */
#define CCM_LPCG_DOMAIN_COUNT                    (138U)

/*! @name LPCG_SETPOINT - LPCG Setpoint setting */
/*! @{ */

#define CCM_LPCG_SETPOINT_SETPOINT_MASK          (0xFFFFU)
#define CCM_LPCG_SETPOINT_SETPOINT_SHIFT         (0U)
/*! SETPOINT - Setpoints */
#define CCM_LPCG_SETPOINT_SETPOINT(x)            (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_SETPOINT_SETPOINT_SHIFT)) & CCM_LPCG_SETPOINT_SETPOINT_MASK)

#define CCM_LPCG_SETPOINT_STANDBY_MASK           (0xFFFF0000U)
#define CCM_LPCG_SETPOINT_STANDBY_SHIFT          (16U)
/*! STANDBY - Standby */
#define CCM_LPCG_SETPOINT_STANDBY(x)             (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_SETPOINT_STANDBY_SHIFT)) & CCM_LPCG_SETPOINT_STANDBY_MASK)
/*! @} */

